tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46j53_tdd.h
#define ADDR6                         522
#define UCFG                          523
#define UPP0                          524
#define PPB0                          525
#define UPP1                          526
#define PPB1                          527
#define FSEN                          528
#define UTRDIS                        529
#define UPUEN                         530
#define UOEMON                        531
#define UTEYE                         532
#define RTCVALL                       533
#define RTCVALH_WAITE0                534
#define RTCVALH                       535
#define RTCVALH_WAITE1                536
#define RTCVALH_WAITM0                537
#define RTCVALH_WAITM1                538
#define RTCVALH_WAITM2                539
#define RTCVALH_WAITM3                540
#define RTCVALH_WAITB0                541
#define RTCVALH_WAITB1                542
#define PADCFG1                       543
#define PMPTTL                        544
#define RTSECSEL0                     545
#define RTSECSEL1                     546
#define REFOCON                       547
#define RODIV0                        548
#define RODIV                         549
#define RODIV1                        550
#define RODIV2                        551
#define RODIV3                        552
#define ROSEL                         553
#define ROSSLP                        554
#define ROON                          555
#define RTCCAL                        556
#define CAL0                          557
#define CAL                           558
#define CAL1                          559
#define CAL2                          560
#define CAL3                          561
#define CAL4                          562
#define CAL5                          563
#define CAL6                          564
#define CAL7                          565
#define RTCCFG                        566
#define RTCPTR0                       567
#define RTCPTR1                       568
#define RTCOE                         569
#define HALFSEC                       570
#define RTCSYNC                       571
#define RTCWREN                       572
#define RTCEN                         573
#define ODCON3                        574
#define SPI1OD                        575
#define SPI2OD                        576
#define ODCON2                        577
#define U1OD                          578
#define U2OD                          579
#define CCP9OD                        580
#define CCP10OD                       581
#define ODCON1                        582
#define ECCP1OD                       583
#define ECCP2OD                       584
#define ECCP3OD                       585
#define CCP4OD                        586
#define CCP5OD                        587
#define CCP6OD                        588
#define CCP7OD                        589
#define CCP8OD                        590
#define ALRMVALL                      591
#define ALRMVALH                      592
#define ALRMRPT                       593
#define ARPT0                         594
#define ARPT                          595
#define ARPT1                         596
#define ARPT2                         597
#define ARPT3                         598
#define ARPT4                         599
#define ARPT5                         600
#define ARPT6                         601
#define ARPT7                         602
#define ALRMCFG                       603
#define ALRMPTR                       604
#define ALRMPTR0                      605
#define ALRMPTR1                      606
#define AMASK0                        607
#define AMASK                         608
#define AMASK1                        609
#define AMASK2                        610
#define AMASK3                        611
#define CHIME                         612
#define ALRMEN                        613
#define ANCON0                        614
#define PCFG0                         615
#define PCFG1                         616
#define PCFG2                         617
#define PCFG3                         618
#define PCFG4                         619
#define PCFG5                         620
#define PCFG6                         621
#define PCFG7                         622
#define ANCON1                        623
#define PCFG8                         624
#define PCFG9                         625
#define PCFG10                        626
#define PCFG11                        627
#define PCFG12                        628
#define PCFG15                        629
#define VBGEN                         630
#define DSWAKEL                       631
#define DSPOR                         632
#define DSMCLR                        633
#define DSRTC                         634
#define DSWDT                         635
#define DSULP                         636
#define DSFLT                         637
#define DSWAKEH                       638
#define DSINT0                        639
#define DSCONL                        640
#define RELEASE                       641
#define DSBOR                         642
#define ULPWDIS                       643
#define DSCONH                        644
#define RTCWDIS                       645
#define DSULPEN                       646
#define DSEN                          647
#define DSGPR0                        648
#define DSGPR1                        649
#define CCPTMRS2                      650
#define C8TSEL0                       651
#define C8TSEL                        652
#define C8TSEL1                       653
#define C9TSEL0                       654
#define C10TSEL0                      655
#define CCPTMRS1                      656
#define C4TSEL                        657
#define C4TSEL0                       658
#define C4TSEL1                       659
#define C5TSEL0                       660
#define C6TSEL0                       661
#define C7TSEL                        662
#define C7TSEL0                       663
#define C7TSEL1                       664
#define CCPTMRS0                      665
#define C1TSEL0                       666
#define C1TSEL                        667
#define C1TSEL1                       668
#define C1TSEL2                       669
#define C2TSEL0                       670
#define C2TSEL                        671
#define C2TSEL1                       672
#define C2TSEL2                       673
#define C3TSEL0                       674
#define C3TSEL                        675
#define C3TSEL1                       676
#define CVRCON                        677
#define CVR                           678
#define CVR0                          679
#define CVR1                          680
#define CVR2                          681
#define CVR3                          682
#define CVRSS                         683
#define CVRR                          684
#define CVROEN                        685
#define CVROE                         686
#define CVREN                         687
#define PMSTATL                       688
#define OB0E                          689
#define OB1E                          690
#define OB2E                          691
#define OB3E                          692
#define OBUF                          693
#define OBE                           694
#define PMSTATH                       695
#define IB0F                          696
#define IB1F                          697
#define IB2F                          698
#define IB3F                          699
#define IBOV                          700
#define IBF                           701
#define PMEL                          702
#define PTEN0                         703
#define PTENL                         704
#define PTEN1                         705
#define PTEN2                         706
#define PTEN3                         707
#define PTEN4                         708
#define PTEN5                         709
#define PTEN6                         710
#define PTEN7                         711
#define PMEH                          712
#define PTEN8                         713
#define PTENH                         714
#define PTEN9                         715
#define PTEN10                        716
#define PTEN11                        717
#define PTEN12                        718
#define PTEN13                        719
#define PTEN14                        720
#define PTEN15                        721
#define PMDIN2L                       722
#define PMDIN2L_DATAL                 723
#define PMDIN2H                       724
#define PMDIN2H_DATAH                 725
#define PMDOUT2L                      726
#define PMDOUT2L_DATAL                727
#define PMDOUT2H                      728
#define PMDOUT2H_DATAH                729
#define PMMODEL                       730
#define WAITE                         731
#define PMMODEL_WAITE0                732
#define PMMODEL_WAITE1                733
#define PMMODEL_WAITM0                734
#define WAITM                         735
#define PMMODEL_WAITM1                736
#define PMMODEL_WAITM2                737
#define PMMODEL_WAITM3                738
#define PMMODEL_WAITB0                739
#define WAITB                         740
#define PMMODEL_WAITB1                741
#define PMMODEH                       742
#define MODE0                         743
#define MODE1                         744
#define MODE16                        745
#define INCM0                         746
#define INCM1                         747
#define IRQM0                         748
#define IRQM1                         749
#define BUSY                          750
#define PMCONL                        751
#define RDSP                          752
#define WRSP                          753
#define BEP                           754
#define CS1P                          755
#define ALP                           756
#define CSF0                          757
#define CSF1                          758
#define PMCONH                        759
#define PTRDEN                        760
#define PTWREN                        761
#define PTBEEN                        762
#define ADRMUX0                       763
#define ADRMUX1                       764
#define PSIDL                         765
#define PMPEN                         766
#define UFRML                         767
#define FRML                          768
#define FRM0                          769
#define UFRML_FRM                     770
#define FRM1                          771
#define FRM2                          772
#define FRM3                          773
#define FRM4                          774
#define FRM5                          775
#define FRM6                          776
#define FRM7                          777
#define UFRMH                         778
#define FRM8                          779
#define UFRMH_FRM                     780
#define FRM9                          781
#define FRM10                         782
#define UIR                           783
#define URSTIF                        784
#define UERRIF                        785
#define ACTVIF                        786
#define TRNIF                         787
#define IDLEIF                        788
#define STALLIF                       789
#define SOFIF                         790
#define UEIR                          791
#define PIDEF                         792
#define CRC5EF                        793
#define CRC16EF                       794
#define DFN8EF                        795
#define BTOEF                         796
#define BTSEF                         797
#define USTAT                         798
#define PPBI                          799
#define DIR                           800
#define ENDP                          801
#define ENDP0                         802
#define ENDP1                         803
#define ENDP2                         804
#define ENDP3                         805
#define UCON                          806
#define SUSPND                        807
#define RESUME                        808
#define USBEN                         809
#define PKTDIS                        810
#define SE0                           811
#define PPBRST                        812
#define DMABCH                        813
#define DMACNTHB                      814
#define DMABCL                        815
#define DMACNTLB                      816
#define RXADDRH                       817
#define DMARCVPTRHB                   818
#define RXADDRL                       819
#define DMARCVPTRLB                   820
#define TXADDRH                       821
#define DMATXPTRHB                    822
#define TXADDRL                       823
#define DMATXPTRLB                    824
#define PMDIN1L                       825
#define PMDIN1L_DATAL                 826
#define PMDIN1H                       827
#define PMDIN1H_DATAH                 828
#define PMADDRL                       829
#define ADDRL                         830
#define PMDOUT1L                      831
#define PMADDRH                       832
#define ADDRH                         833
#define CS1                           834
#define PMDOUT1H                      835
#define CMSTAT                        836
#define COUT1                         837
#define COUT2                         838
#define COUT3                         839
#define SSP2CON2                      840
#define SEN2                          841
#define SSP2CON2_SEN                  842
#define ADMSK12                       843
#define SSP2CON2_RSEN                 844
#define RSEN2                         845
#define SSP2CON2_ADMSK1               846
#define ADMSK22                       847
#define PEN2                          848
#define SSP2CON2_PEN                  849
#define SSP2CON2_ADMSK2               850
#define ADMSK32                       851
#define SSP2CON2_RCEN                 852
#define RCEN2                         853
#define SSP2CON2_ADMSK3               854
#define ACKEN2                        855
#define ADMSK42                       856
#define SSP2CON2_ADMSK4               857
#define SSP2CON2_ACKEN                858
#define ACKDT2                        859
#define ADMSK52                       860
#define SSP2CON2_ACKDT                861
#define SSP2CON2_ADMSK5               862
#define SSP2CON2_ACKSTAT              863
#define ACKSTAT2                      864
#define SSP2CON2_GCEN                 865
#define GCEN2                         866
#define SSP2CON1                      867
#define SSP2CON1_SSPM                 868
#define SSP2CON1_SSPM0                869
#define SSPM02                        870
#define SSPM12                        871
#define SSP2CON1_SSPM1                872
#define SSP2CON1_SSPM2                873
#define SSPM22                        874
#define SSPM32                        875
#define SSP2CON1_SSPM3                876
#define SSP2CON1_CKP                  877
#define CKP2                          878
#define SSPEN2                        879
#define SSP2CON1_SSPEN                880
#define SSPOV2                        881
#define SSP2CON1_SSPOV                882
#define WCOL2                         883
#define SSP2CON1_WCOL                 884
#define SSP2STAT                      885
#define SSP2STAT_BF                   886
#define BF2                           887
#define SSP2STAT_UA                   888
#define UA2                           889
#define RW2                           890
#define READ_WRITE2                   891
#define nW2                           892
#define I2C_READ2                     893
#define SSP2STAT_R_NOT_W              894
#define R_nW2                         895
#define nWRITE2                       896
#define R_W2                          897
#define SSP2STAT_R_nW                 898
#define SSP2STAT_S                    899
#define S2                            900
#define START2                        901
#define I2C_START2                    902
#define P2                            903
#define SSP2STAT_P                    904
#define STOP2                         905
#define I2C_STOP2                     906
#define I2C_DAT2                      907
#define DATA_ADDRESS2                 908
#define SSP2STAT_D_NOT_A              909
#define D_A2                          910
#define SSP2STAT_D_nA                 911
#define nA2                           912
#define DA2                           913
#define nADDRESS2                     914
#define D_nA2                         915
#define SSP2STAT_CKE                  916
#define CKE2                          917
#define SSP2STAT_SMP                  918
#define SMP2                          919
#define SSP2ADD                       920
#define MSK02                         921
#define SSP2ADD_SSPADD                922
#define MSK12                         923
#define MSK22                         924
#define MSK32                         925
#define MSK42                         926
#define MSK52                         927
#define MSK62                         928
#define MSK72                         929
#define SSP2MSK                       930
#define SSP2MSK_MSK0                  931
#define SSP2MSK_MSK1                  932
#define SSP2MSK_MSK2                  933
#define SSP2MSK_MSK3                  934
#define SSP2MSK_MSK4                  935
#define SSP2MSK_MSK5                  936
#define SSP2MSK_MSK6                  937
#define SSP2MSK_MSK7                  938
#define SSP2BUF                       939
#define SSP2BUF_SSPBUF                940
#define T4CON                         941
#define T4CKPS0                       942
#define T4CKPS                        943
#define T4CKPS1                       944
#define TMR4ON                        945
#define T4OUTPS                       946
#define T4OUTPS0                      947
#define T4OUTPS1                      948
#define T4OUTPS2                      949
#define T4OUTPS3                      950
#define PR4                           951
#define TMR4                          952
#define T3CON                         953
#define TMR3ON                        954
#define T3CON_RD16                    955
#define nT3SYNC                       956
#define NOT_T3SYNC                    957
#define SOSCEN3                       958
#define T3OSCEN                       959
#define T3CKPS                        960
#define T3CKPS0                       961
#define T3CKPS1                       962
#define TMR3CS0                       963
#define TMR3CS                        964
#define TMR3CS1                       965
#define T3RD16                        966
#define RD163                         967
#define TMR3L                         968
#define TMR3H                         969
#define BAUDCON2                      970
#define ABDEN2                        971
#define BAUDCON2_ABDEN                972
#define WUE2                          973
#define BAUDCON2_WUE                  974
#define BRG162                        975
#define BAUDCON2_BRG16                976
#define SCKP2                         977
#define TXCKP2                        978
#define BAUDCON2_TXCKP                979
#define DTRXP2                        980
#define RXDTP2                        981
#define BAUDCON2_RXDTP                982
#define RCMT2                         983
#define RCIDL2                        984
#define BAUDCON2_RCIDL                985
#define BAUDCON2_ABDOVF               986
#define ABDOVF2                       987
#define SPBRGH2                       988
#define BAUDCON1                      989
#define BAUDCON1_ABDEN                990
#define ABDEN1                        991
#define BAUDCON1_WUE                  992
#define WUE1                          993
#define W4E                           994
#define BRG161                        995
#define BAUDCON1_BRG16                996
#define CKTXP                         997
#define BAUDCON1_TXCKP                998
#define SCKP1                         999
#define TXCKP1                        1000
#define SCKP                          1001
#define DTRXP1                        1002
#define RXDTP1                        1003
#define DTRXP                         1004
#define RXCKP                         1005
#define BAUDCON1_RXDTP                1006
#define RCMT1                         1007
#define RCIDL1                        1008
#define BAUDCON1_RCIDL                1009
#define RCMT                          1010
#define ABDOVF1                       1011
#define BAUDCON1_ABDOVF               1012
#define SPBRGH1                       1013
#define PORTA                         1014
#define C1INA                         1015
#define AN0                           1016
#define ULPWUIN                       1017
#define ULPWU                         1018
#define RP0                           1019
#define RA0                           1020
#define PMA6                          1021
#define VBG                           1022
#define PMA7                          1023
#define AN1                           1024
#define RP1                           1025
#define RA1                           1026
#define C2INA                         1027
#define C1IND                         1028
#define AN2                           1029
#define C3INB                         1030
#define CVREF                         1031
#define RA2                           1032
#define VREF_MINUS                    1033
#define C2INB                         1034
#define C1INB                         1035
#define AN3                           1036
#define VREF_PLUS                     1037
#define RA3                           1038
#define RCV                           1039
#define AN4                           1040
#define C1INC                         1041
#define NOT_SS1                       1042
#define RP2                           1043
#define LVDIN                         1044
#define RA5                           1045
#define nSS1                          1046
#define HLVDIN                        1047
#define CLKO                          1048
#define RA6                           1049
#define OSC2                          1050
#define CLKI                          1051
#define RJPU                          1052
#define RA7                           1053
#define OSC1                          1054
#define PORTB                         1055
#define RB0                           1056
#define C3IND                         1057
#define INT0                          1058
#define RP3                           1059
#define AN12                          1060
#define RB1                           1061
#define C3INC                         1062
#define RP4                           1063
#define PMPBE                         1064
#define RTCC                          1065
#define PMBE                          1066
#define AN10                          1067
#define REFO                          1068
#define PMA3                          1069
#define AN8                           1070
#define RB2                           1071
#define C2INC                         1072
#define RP5                           1073
#define VMO                           1074
#define CTED1                         1075
#define RP6                           1076
#define PMA2                          1077
#define AN9                           1078
#define RB3                           1079
#define VPO                           1080
#define C3INA                         1081
#define CCP2_PA2                      1082
#define CTED2                         1083
#define PMA1                          1084
#define SCK1                          1085
#define CCP4                          1086
#define RB4                           1087
#define RP7                           1088
#define SCL1                          1089
#define KBI0                          1090
