tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46j53_tdd.h
#define SDA1                          1091
#define PMA0                          1092
#define CCP5                          1093
#define RB5                           1094
#define RP8                           1095
#define SDI1                          1096
#define KBI1                          1097
#define CCP6                          1098
#define PGC                           1099
#define RB6                           1100
#define RP9                           1101
#define KBI2                          1102
#define CCP7                          1103
#define PGD                           1104
#define RB7                           1105
#define RP10                          1106
#define KBI3                          1107
#define PORTC                         1108
#define T1CKI                         1109
#define RP11                          1110
#define T1OSO                         1111
#define RC0                           1112
#define CCP8                          1113
#define CCP2                          1114
#define NOT_UOE                       1115
#define nUOE                          1116
#define RP12                          1117
#define T1OSI                         1118
#define PA2                           1119
#define RC1                           1120
#define RP13                          1121
#define CTPLS                         1122
#define PA1                           1123
#define RC2                           1124
#define C2IND                         1125
#define AN11                          1126
#define D_MINUS                       1127
#define VM                            1128
#define RC4                           1129
#define D_PLUS                        1130
#define VP                            1131
#define RC5                           1132
#define PMA5                          1133
#define CCP9                          1134
#define RP17                          1135
#define TX1                           1136
#define RC6                           1137
#define CK1                           1138
#define PMA4                          1139
#define SDO1                          1140
#define RP18                          1141
#define RX1                           1142
#define PORTC_CCP10                   1143
#define RC7                           1144
#define DT1                           1145
#define PORTD                         1146
#define RD0                           1147
#define SCL2                          1148
#define PMD0                          1149
#define RD1                           1150
#define SDA2                          1151
#define PMD1                          1152
#define RD2                           1153
#define RP19                          1154
#define PMD2                          1155
#define RD3                           1156
#define PMD3                          1157
#define RP20                          1158
#define RD4                           1159
#define PMD4                          1160
#define RP21                          1161
#define RD5                           1162
#define PMD5                          1163
#define RP22                          1164
#define RD6                           1165
#define PMD6                          1166
#define RP23                          1167
#define SS2                           1168
#define RD7                           1169
#define PMD7                          1170
#define RP24                          1171
#define PORTE                         1172
#define PD2                           1173
#define RE0                           1174
#define PMRD                          1175
#define RDE                           1176
#define AN5                           1177
#define PMPRD                         1178
#define WRE                           1179
#define PMPWR                         1180
#define RE1                           1181
#define AN6                           1182
#define PMWR                          1183
#define PC2                           1184
#define PMCS                          1185
#define RE2                           1186
#define PB2                           1187
#define AN7                           1188
#define CS                            1189
#define PMPCS                         1190
#define PORTE_CCP10                   1191
#define HLVDCON                       1192
#define HLVDL                         1193
#define HLVDL0                        1194
#define HLVDL1                        1195
#define HLVDL2                        1196
#define HLVDL3                        1197
#define HLVDEN                        1198
#define IRVST                         1199
#define BGVST                         1200
#define VDIRMAG                       1201
#define DMACON2                       1202
#define INTLVL0                       1203
#define INTLVL                        1204
#define INTLVL1                       1205
#define INTLVL2                       1206
#define INTLVL3                       1207
#define DLYCYC                        1208
#define DLYCYC0                       1209
#define DLYCYC1                       1210
#define DLYCYC2                       1211
#define DLYCYC3                       1212
#define OSCCON2                       1213
#define PRISD                         1214
#define SOSCGO                        1215
#define SOSCDRV                       1216
#define SOSCRUN                       1217
#define DMACON1                       1218
#define DMAEN                         1219
#define DLYINTEN                      1220
#define DUPLEX0                       1221
#define DUPLEX1                       1222
#define RXINC                         1223
#define TXINC                         1224
#define SSCON0                        1225
#define SSCON1                        1226
#define LATA                          1227
#define LATA0                         1228
#define LA0                           1229
#define LATA1                         1230
#define LA1                           1231
#define LATA2                         1232
#define LA2                           1233
#define LATA3                         1234
#define LA3                           1235
#define LATA5                         1236
#define LA5                           1237
#define LATA6                         1238
#define LA6                           1239
#define LATA7                         1240
#define LA7                           1241
#define LATB                          1242
#define LB0                           1243
#define LATB0                         1244
#define LB1                           1245
#define LATB1                         1246
#define LB2                           1247
#define LATB2                         1248
#define LB3                           1249
#define LATB3                         1250
#define LB4                           1251
#define LATB4                         1252
#define LB5                           1253
#define LATB5                         1254
#define LB6                           1255
#define LATB6                         1256
#define LB7                           1257
#define LATB7                         1258
#define LATC                          1259
#define LATC0                         1260
#define LC0                           1261
#define LATC1                         1262
#define LC1                           1263
#define LATC2                         1264
#define LC2                           1265
#define LC6                           1266
#define LATC6                         1267
#define LATC7                         1268
#define LC7                           1269
#define LATD                          1270
#define LATD0                         1271
#define LD0                           1272
#define LATD1                         1273
#define LD1                           1274
#define LATD2                         1275
#define LD2                           1276
#define LATD3                         1277
#define LD3                           1278
#define LATD4                         1279
#define LD4                           1280
#define LATD5                         1281
#define LD5                           1282
#define LATD6                         1283
#define LD6                           1284
#define LATD7                         1285
#define LD7                           1286
#define LATE                          1287
#define LATE0                         1288
#define LE0                           1289
#define LATE1                         1290
#define LE1                           1291
#define LATE2                         1292
#define LE2                           1293
#define PIE4                          1294
#define CCP3IE                        1295
#define CCP4IE                        1296
#define CCP5IE                        1297
#define CCP6IE                        1298
#define CCP7IE                        1299
#define CCP8IE                        1300
#define CCP9IE                        1301
#define CCP10IE                       1302
#define PIR4                          1303
#define CCP3IF                        1304
#define CCP4IF                        1305
#define CCP5IF                        1306
#define CCP6IF                        1307
#define CCP7IF                        1308
#define CCP8IF                        1309
#define CCP9IF                        1310
#define CCP10IF                       1311
#define IPR4                          1312
#define CCP3IP                        1313
#define CCIP3IP                       1314
#define CCP4IP                        1315
#define CCP5IP                        1316
#define CCP6IP                        1317
#define CCP7IP                        1318
#define CCP8IP                        1319
#define CCP9IP                        1320
#define CCP10IP                       1321
#define PIE5                          1322
#define TMR1GIE                       1323
#define TMR5GIE                       1324
#define TMR5IE                        1325
#define TMR6IE                        1326
#define TMR8IE                        1327
#define CM3IE                         1328
#define TRISA                         1329
#define TRISA0                        1330
#define TRISA1                        1331
#define TRISA2                        1332
#define TRISA3                        1333
#define TRISA5                        1334
#define TRISA6                        1335
#define TRISA7                        1336
#define TRISB                         1337
#define TRISB0                        1338
#define TRISB1                        1339
#define TRISB2                        1340
#define TRISB3                        1341
#define TRISB4                        1342
#define TRISB5                        1343
#define TRISB6                        1344
#define TRISB7                        1345
#define TRISC                         1346
#define TRISC0                        1347
#define TRISC1                        1348
#define TRISC2                        1349
#define TRISC6                        1350
#define TRISC7                        1351
#define TRISD                         1352
#define TRISD0                        1353
#define TRISD1                        1354
#define TRISD2                        1355
#define TRISD3                        1356
#define TRISD4                        1357
#define TRISD5                        1358
#define TRISD6                        1359
#define TRISD7                        1360
#define TRISE                         1361
#define TRISE0                        1362
#define TRISE1                        1363
#define TRISE2                        1364
#define REPU                          1365
#define RDPU                          1366
#define T3GCON                        1367
#define T3GSS0                        1368
#define T3GSS1                        1369
#define T3GVAL                        1370
#define T3GGO                         1371
#define T3GGO_T3DONE                  1372
#define NOT_T3DONE                    1373
#define nT3DONE                       1374
#define T3GSPM                        1375
#define T3GTM                         1376
#define T3GPOL                        1377
#define TMR3GE                        1378
#define PIR5                          1379
#define TMR1GIF                       1380
#define TMR5GIF                       1381
#define TMR5IF                        1382
#define TMR6IF                        1383
#define TMR8IF                        1384
#define CM3IF                         1385
#define IPR5                          1386
#define CCH05                         1387
#define TMR1GIP                       1388
#define TMR5GIP                       1389
#define CCH15                         1390
#define TMR5IP                        1391
#define EVPOL05                       1392
#define TMR6IP                        1393
#define EVPOL15                       1394
#define TMR8IP                        1395
#define CM3IP                         1396
#define T1GCON                        1397
#define T1GSS0                        1398
#define T1GSS1                        1399
#define T1GVAL                        1400
#define T1GGO_nT1DONE                 1401
#define T1DONE                        1402
#define nT1DONE                       1403
#define T1GGO_NOT_T1DONE              1404
#define NOT_T1DONE                    1405
#define T1GGO                         1406
#define T1GSPM                        1407
#define T1GTM                         1408
#define T1GPOL                        1409
#define TMR1GE                        1410
#define OSCTUNE                       1411
#define TUN0                          1412
#define TUN                           1413
#define TUN1                          1414
#define TUN2                          1415
#define TUN3                          1416
#define TUN4                          1417
#define TUN5                          1418
#define PLLEN                         1419
#define INTSRC                        1420
#define RCSTA2                        1421
#define RCD82                         1422
#define RX9D2                         1423
#define RCSTA2_RX9D                   1424
#define OERR2                         1425
#define RCSTA2_OERR                   1426
#define FERR2                         1427
#define RCSTA2_FERR                   1428
#define ADDEN2                        1429
#define RCSTA2_ADDEN                  1430
#define RCSTA2_CREN                   1431
#define CREN2                         1432
#define SREN2                         1433
#define RCSTA2_SREN                   1434
#define RC92                          1435
#define RC8_92                        1436
#define RCSTA2_RX9                    1437
#define RX92                          1438
#define RCSTA2_SPEN                   1439
#define SPEN2                         1440
#define PIE1                          1441
#define TMR1IE                        1442
#define TMR2IE                        1443
#define CCP1IE                        1444
#define SSP1IE                        1445
#define SSPIE                         1446
#define TXIE                          1447
#define TX1IE                         1448
#define RC1IE                         1449
#define RCIE                          1450
#define ADIE                          1451
#define PSPIE                         1452
#define PMPIE                         1453
#define PIR1                          1454
#define TMR1IF                        1455
#define TMR2IF                        1456
#define CCP1IF                        1457
#define SSPIF                         1458
#define SSP1IF                        1459
#define TXIF                          1460
#define TX1IF                         1461
#define RCIF                          1462
#define RC1IF                         1463
#define ADIF                          1464
#define PSPIF                         1465
#define PMPIF                         1466
#define IPR1                          1467
#define TMR1IP                        1468
#define TMR2IP                        1469
#define CCP1IP                        1470
#define SSPIP                         1471
#define SSP1IP                        1472
#define TX1IP                         1473
#define TXIP                          1474
#define RCIP                          1475
#define RC1IP                         1476
#define ADIP                          1477
#define PMPIP                         1478
#define PSPIP                         1479
#define PIE2                          1480
#define CCP2IE                        1481
#define TMR3IE                        1482
#define HLVDIE                        1483
#define LVDIE                         1484
#define BCL1IE                        1485
#define BCLIE                         1486
#define USBIE                         1487
#define CM1IE                         1488
#define CMIE                          1489
#define CM2IE                         1490
#define OSCFIE                        1491
#define PIR2                          1492
#define CCP2IF                        1493
#define TMR3IF                        1494
#define HLVDIF                        1495
#define LVDIF                         1496
#define BCL1IF                        1497
#define BCLIF                         1498
#define USBIF                         1499
#define CM1IF                         1500
#define CMIF                          1501
#define CM2IF                         1502
#define OSCFIF                        1503
#define IPR2                          1504
#define CCP2IP                        1505
#define TMR3IP                        1506
#define HLVDIP                        1507
#define LVDIP                         1508
#define BCLIP                         1509
#define BCL1IP                        1510
#define USBIP                         1511
#define CM1IP                         1512
#define CM2IP                         1513
#define CMIP                          1514
#define OSCFIP                        1515
#define PIE3                          1516
#define RTCCIE                        1517
#define RXB0IE                        1518
#define RXBNIE                        1519
#define TMR3GIE                       1520
#define RXB1IE                        1521
#define CTMUIE                        1522
#define TXB0IE                        1523
#define TMR4IE                        1524
#define TXB1IE                        1525
#define TXB2IE                        1526
#define TXBNIE                        1527
#define TX2IE                         1528
#define RC2IE                         1529
#define BCL2IE                        1530
#define SSP2IE                        1531
#define PIR3                          1532
#define RTCCIF                        1533
#define RXBNIF                        1534
#define TMR3GIF                       1535
#define CTMUIF                        1536
#define TMR4IF                        1537
#define TXBNIF                        1538
#define TX2IF                         1539
#define RC2IF                         1540
#define BCL2IF                        1541
#define SSP2IF                        1542
#define IPR3                          1543
#define RTCCIP                        1544
#define TMR3GIP                       1545
#define RXBNIP                        1546
#define CTMUIP                        1547
#define TMR4IP                        1548
#define TX2IP                         1549
#define TXBNIP                        1550
#define RC2IP                         1551
#define BCL2IP                        1552
#define SSP2IP                        1553
#define EECON1                        1554
#define WR                            1555
#define WREN                          1556
#define WRERR                         1557
#define FREE                          1558
#define WPROG                         1559
#define EECON2                        1560
#define TXSTA2                        1561
#define TX9D2                         1562
#define TXSTA2_TX9D                   1563
#define TXD82                         1564
#define TRMT2                         1565
#define TXSTA2_TRMT                   1566
#define BRGH2                         1567
#define TXSTA2_BRGH                   1568
#define SENDB2                        1569
#define TXSTA2_SENDB                  1570
#define TXSTA2_SYNC                   1571
#define SYNC2                         1572
#define TXEN2                         1573
#define TXSTA2_TXEN                   1574
#define TX8_92                        1575
#define TX92                          1576
#define TXSTA2_TX9                    1577
#define TXSTA2_CSRC                   1578
#define CSRC2                         1579
#define TXREG2                        1580
#define RCREG2                        1581
#define SPBRG2                        1582
#define RCSTA1                        1583
#define RCSTA1_RX9D                   1584
#define RX9D1                         1585
#define RCD8                          1586
#define RCSTA1_OERR                   1587
#define OERR1                         1588
#define RCSTA1_FERR                   1589
#define FERR1                         1590
#define RCSTA1_ADDEN                  1591
#define ADDEN1                        1592
#define ADEN                          1593
#define RCSTA1_CREN                   1594
#define CREN1                         1595
#define SRENA                         1596
#define SREN1                         1597
#define RCSTA1_SREN                   1598
#define RC8_9                         1599
#define RCSTA1_RX9                    1600
#define nRC8                          1601
#define NOT_RC8                       1602
#define RC9                           1603
#define RX91                          1604
#define RCSTA1_SPEN                   1605
#define SPEN1                         1606
#define TXSTA1                        1607
#define TX9D1                         1608
#define TXSTA1_TX9D                   1609
#define TXD8                          1610
#define TRMT1                         1611
#define TXSTA1_TRMT                   1612
#define BRGH1                         1613
#define TXSTA1_BRGH                   1614
#define TXSTA1_SENDB                  1615
#define SENDB1                        1616
#define TXSTA1_SYNC                   1617
#define SYNC1                         1618
#define TXEN1                         1619
#define TXSTA1_TXEN                   1620
#define TX91                          1621
#define TX8_9                         1622
#define NOT_TX8                       1623
#define nTX8                          1624
#define TXSTA1_TX9                    1625
#define TXSTA1_CSRC                   1626
#define CSRC1                         1627
#define TXREG1                        1628
#define RCREG1                        1629
#define SPBRG1                        1630
#define CTMUICON                      1631
#define IRNG                          1632
#define IRNG0                         1633
#define IRNG1                         1634
#define ITRIM0                        1635
#define ITRIM                         1636
#define ITRIM1                        1637
#define ITRIM2                        1638
#define ITRIM3                        1639
#define ITRIM4                        1640
#define ITRIM5                        1641
#define CTMUCONL                      1642
#define EDG1STAT                      1643
#define EDG2STAT                      1644
#define EDG1SEL0                      1645
#define EDG1SEL1                      1646
#define EDG1POL                       1647
#define EDG2SEL0                      1648
