tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf46j53_tdd.h
#define EDG2SEL1                      1649
#define EDG2POL                       1650
#define CTMUCONH                      1651
#define CTTRIG                        1652
#define IDISSEN                       1653
#define EDGSEQEN                      1654
#define EDGEN                         1655
#define TGEN                          1656
#define CTMUSIDL                      1657
#define CTMUEN                        1658
#define CCP2CON                       1659
#define CCP2M                         1660
#define CCP2M0                        1661
#define CCP2M1                        1662
#define CCP2M2                        1663
#define CCP2M3                        1664
#define DC2B                          1665
#define DC2B0                         1666
#define CCP2Y                         1667
#define DC2B1                         1668
#define CCP2X                         1669
#define P2M                           1670
#define P2M0                          1671
#define P2M1                          1672
#define CCPR2L                        1673
#define CCPR2H                        1674
#define ECCP2DEL                      1675
#define ECCP2DEL_P2DC0                1676
#define P2DC                          1677
#define ECCP2DEL_P2DC1                1678
#define ECCP2DEL_P2DC2                1679
#define ECCP2DEL_P2DC3                1680
#define ECCP2DEL_P2DC4                1681
#define ECCP2DEL_P2DC5                1682
#define ECCP2DEL_P2DC6                1683
#define P2RSEN                        1684
#define PSS2BD                        1685
#define PSS2BD0                       1686
#define PSS2BD1                       1687
#define PSS2AC0                       1688
#define PSS2AC                        1689
#define PSS2AC1                       1690
#define ECCP2AS0                      1691
#define ECCP2AS                       1692
#define ECCP2AS1                      1693
#define ECCP2AS2                      1694
#define ECCP2ASE                      1695
#define PSTR2CON                      1696
#define PSTR2CON_STRA                 1697
#define P2DC02                        1698
#define STRA2                         1699
#define P2DC0CON                      1700
#define PSTR2CON_P2DC0                1701
#define STRB2                         1702
#define P2DC12                        1703
#define PSTR2CON_STRB                 1704
#define PSTR2CON_P2DC1                1705
#define P2DC1CON                      1706
#define PSTR2CON_STRC                 1707
#define STRC2                         1708
#define PSTR2CON_P2DC2                1709
#define P2DC22                        1710
#define P2DC2CON                      1711
#define P2DC32                        1712
#define STRD2                         1713
#define PSTR2CON_STRD                 1714
#define P2DC3CON                      1715
#define PSTR2CON_P2DC3                1716
#define P2DC4CON                      1717
#define STRSYNC2                      1718
#define PSTR2CON_STRSYNC              1719
#define PSTR2CON_P2DC4                1720
#define P2DC42                        1721
#define P2DC52                        1722
#define P2DC5CON                      1723
#define PSTR2CON_P2DC5                1724
#define P2DC6CON                      1725
#define CMPL02                        1726
#define PSTR2CON_P2DC6                1727
#define P2DC62                        1728
#define PSTR2CON_CMPL0                1729
#define CMPL12                        1730
#define PSTR2CON_CMPL1                1731
#define CCP1CON                       1732
#define CCP1M0                        1733
#define CCP1M                         1734
#define CCP1M1                        1735
#define CCP1M2                        1736
#define CCP1M3                        1737
#define CCP1Y                         1738
#define DC1B                          1739
#define DC1B0                         1740
#define CCP1X                         1741
#define DC1B1                         1742
#define P1M                           1743
#define P1M0                          1744
#define P1M1                          1745
#define CCPR1L                        1746
#define CCPR1H                        1747
#define ECCP1DEL                      1748
#define P1DC                          1749
#define P1DC0                         1750
#define P1DC1                         1751
#define P1DC2                         1752
#define P1DC3                         1753
#define P1DC4                         1754
#define P1DC5                         1755
#define P1DC6                         1756
#define P1RSEN                        1757
#define PSS1BD0                       1758
#define PSS1BD                        1759
#define PSS1BD1                       1760
#define PSS1AC                        1761
#define PSS1AC0                       1762
#define PSS1AC1                       1763
#define ECCP1AS                       1764
#define ECCP1AS0                      1765
#define ECCP1AS1                      1766
#define ECCP1AS2                      1767
#define ECCP1ASE                      1768
#define PSTR1CON                      1769
#define PSTR1CON_STRA                 1770
#define PSTR1CON_STRB                 1771
#define PSTR1CON_STRC                 1772
#define PSTR1CON_STRD                 1773
#define PSTR1CON_STRSYNC              1774
#define PSTR1CON_CMPL0                1775
#define PSTR1CON_CMPL1                1776
#define WDTCON                        1777
#define SWDTEN                        1778
#define SWDTE                         1779
#define ULPSINK                       1780
#define ULPEN                         1781
#define DS                            1782
#define VBGOE                         1783
#define ULPLVL                        1784
#define LVDSTAT                       1785
#define REGSLP                        1786
#define ADCON1                        1787
#define ADCS0                         1788
#define ADCS                          1789
#define ADCS1                         1790
#define ADCS2                         1791
#define ACQT0                         1792
#define ACQT                          1793
#define CHSN3                         1794
#define ACQT1                         1795
#define VCFG01                        1796
#define ACQT2                         1797
#define VCFG11                        1798
#define ADCON1_ADCAL                  1799
#define ADFM                          1800
#define ADCON0                        1801
#define ADON                          1802
#define nDONE                         1803
#define GO_nDONE                      1804
#define NOT_DONE                      1805
#define GODONE                        1806
#define GO_DONE                       1807
#define DONE                          1808
#define GO                            1809
#define GO_NOT_DONE                   1810
#define CHS                           1811
#define CHS0                          1812
#define CHS1                          1813
#define CHS2                          1814
#define CHS3                          1815
#define VCFG                          1816
#define VCFG0                         1817
#define VCFG1                         1818
#define ADCON0_ADCAL                  1819
#define ADRESL                        1820
#define ADRESH                        1821
#define SSP1CON2                      1822
#define SEN1                          1823
#define SSP1CON2_SEN                  1824
#define ADMSK11                       1825
#define SSP1CON2_RSEN                 1826
#define RSEN1                         1827
#define SSP1CON2_ADMSK1               1828
#define SSP1CON2_PEN                  1829
#define ADMSK21                       1830
#define PEN1                          1831
#define SSP1CON2_ADMSK2               1832
#define ADMSK31                       1833
#define RCEN1                         1834
#define SSP1CON2_RCEN                 1835
#define SSP1CON2_ADMSK3               1836
#define SSP1CON2_ACKEN                1837
#define ACKEN1                        1838
#define ADMSK41                       1839
#define SSP1CON2_ADMSK4               1840
#define ACKDT1                        1841
#define ADMSK51                       1842
#define SSP1CON2_ACKDT                1843
#define SSP1CON2_ADMSK5               1844
#define SSP1CON2_ACKSTAT              1845
#define ACKSTAT1                      1846
#define GCEN1                         1847
#define SSP1CON2_GCEN                 1848
#define SSP1CON1                      1849
#define SSP1CON1_SSPM0                1850
#define SSPM01                        1851
#define SSP1CON1_SSPM                 1852
#define SSP1CON1_SSPM1                1853
#define SSPM11                        1854
#define SSP1CON1_SSPM2                1855
#define SSPM21                        1856
#define SSPM31                        1857
#define SSP1CON1_SSPM3                1858
#define SSP1CON1_CKP                  1859
#define CKP1                          1860
#define SSPEN1                        1861
#define SSP1CON1_SSPEN                1862
#define SSPOV1                        1863
#define SSP1CON1_SSPOV                1864
#define WCOL1                         1865
#define SSP1CON1_WCOL                 1866
#define SSP1STAT                      1867
#define BF1                           1868
#define SSP1STAT_BF                   1869
#define SSP1STAT_UA                   1870
#define UA1                           1871
#define SSP1STAT_R_NOT_W              1872
#define READ_WRITE                    1873
#define RW1                           1874
#define NOT_W                         1875
#define I2C_READ                      1876
#define nW                            1877
#define RW                            1878
#define nWRITE                        1879
#define R                             1880
#define NOT_WRITE                     1881
#define R_W                           1882
#define SSP1STAT_R_nW                 1883
#define SSP1STAT_S                    1884
#define START                         1885
#define START1                        1886
#define I2C_START                     1887
#define STOP                          1888
#define SSP1STAT_P                    1889
#define STOP1                         1890
#define I2C_STOP                      1891
#define SSP1STAT_D_NOT_A              1892
#define NOT_A                         1893
#define SSP1STAT_D_nA                 1894
#define nA                            1895
#define D_A                           1896
#define D                             1897
#define DA1                           1898
#define DA                            1899
#define DATA_ADDRESS                  1900
#define NOT_ADDRESS                   1901
#define nADDRESS                      1902
#define I2C_DAT                       1903
#define SSP1STAT_CKE                  1904
#define CKE1                          1905
#define SSP1STAT_SMP                  1906
#define SMP1                          1907
#define SSP1ADD                       1908
#define SSP1ADD_SSPADD                1909
#define SSP1ADD_MSK0                  1910
#define MSK01                         1911
#define SSP1ADD_MSK1                  1912
#define MSK11                         1913
#define SSP1ADD_MSK2                  1914
#define MSK21                         1915
#define MSK31                         1916
#define SSP1ADD_MSK3                  1917
#define SSP1ADD_MSK4                  1918
#define MSK41                         1919
#define MSK51                         1920
#define SSP1ADD_MSK5                  1921
#define SSP1ADD_MSK6                  1922
#define MSK61                         1923
#define MSK71                         1924
#define SSP1ADD_MSK7                  1925
#define SSP1MSK                       1926
#define SSP1MSK_MSK0                  1927
#define SSP1MSK_MSK1                  1928
#define SSP1MSK_MSK2                  1929
#define SSP1MSK_MSK3                  1930
#define SSP1MSK_MSK4                  1931
#define SSP1MSK_MSK5                  1932
#define SSP1MSK_MSK6                  1933
#define SSP1MSK_MSK7                  1934
#define SSP1BUF                       1935
#define SSP1BUF_SSPBUF                1936
#define T2CON                         1937
#define T2CKPS0                       1938
#define T2CKPS                        1939
#define T2CKPS1                       1940
#define TMR2ON                        1941
#define T2OUTPS0                      1942
#define T2OUTPS                       1943
#define T2OUTPS1                      1944
#define T2OUTPS2                      1945
#define T2OUTPS3                      1946
#define WM0                           1947
#define PR2                           1948
#define WM1                           1949
#define WAIT0                         1950
#define WAIT1                         1951
#define EBDIS                         1952
#define TMR2                          1953
#define T1CON                         1954
#define TMR1ON                        1955
#define T1CON_RD16                    1956
#define NOT_T1SYNC                    1957
#define nT1SYNC                       1958
#define T1OSCEN                       1959
#define SOSCEN                        1960
#define T1CKPS0                       1961
#define T1CKPS                        1962
#define T1CKPS1                       1963
#define TMR1CS0                       1964
#define TMR1CS                        1965
#define T1RD16                        1966
#define TMR1CS1                       1967
#define TMR1L                         1968
#define TMR1H                         1969
#define RCON                          1970
#define BOR                           1971
#define NOT_BOR                       1972
#define nBOR                          1973
#define POR                           1974
#define nPOR                          1975
#define NOT_POR                       1976
#define PD                            1977
#define nPD                           1978
#define NOT_PD                        1979
#define nTO                           1980
#define TO                            1981
#define NOT_TO                        1982
#define nRI                           1983
#define NOT_RI                        1984
#define RI                            1985
#define NOT_CM                        1986
#define CM                            1987
#define nCM                           1988
#define IPEN                          1989
#define CM2CON                        1990
#define CM2CON_CCH                    1991
#define CM2CON_CCH0                   1992
#define CCH02                         1993
#define CCH12                         1994
#define CM2CON_CCH1                   1995
#define CM2CON_CREF                   1996
#define CREF2                         1997
#define CM2CON_EVPOL                  1998
#define EVPOL02                       1999
#define CM2CON_EVPOL0                 2000
#define EVPOL12                       2001
#define CM2CON_EVPOL1                 2002
#define CM2CON_CPOL                   2003
#define CPOL2                         2004
#define CM2CON_COE                    2005
#define COE2                          2006
#define CM2CON_CON                    2007
#define CON2                          2008
#define CM1CON                        2009
#define CM1CON_CCH                    2010
#define C1CH0                         2011
#define CM1CON_CCH0                   2012
#define CCH01                         2013
#define CCH11                         2014
#define C1CH1                         2015
#define CM1CON_CCH1                   2016
#define CM1CON_CREF                   2017
#define CREF1                         2018
#define EVPOL01                       2019
#define CM1CON_EVPOL0                 2020
#define CM1CON_EVPOL                  2021
#define CM1CON_EVPOL1                 2022
#define EVPOL11                       2023
#define CM1CON_CPOL                   2024
#define CPOL1                         2025
#define CM1CON_COE                    2026
#define COE1                          2027
#define CM1CON_CON                    2028
#define CON1                          2029
#define OSCCON                        2030
#define SCS0                          2031
#define SCS                           2032
#define SCS1                          2033
#define FLTS                          2034
#define OSTS                          2035
#define IRCF                          2036
#define IRCF0                         2037
#define IRCF1                         2038
#define IRCF2                         2039
#define IDLEN                         2040
#define T0CON                         2041
#define T0PS                          2042
#define T0PS0                         2043
#define T0PS1                         2044
#define T0PS2                         2045
#define PSA                           2046
#define T0SE                          2047
#define T0CS                          2048
#define T08BIT                        2049
#define TMR0ON                        2050
#define TMR0L                         2051
#define TMR0H                         2052
#define STATUS                        2053
#define C                             2054
#define CARRY                         2055
#define DC                            2056
#define ZERO                          2057
#define Z                             2058
#define OV                            2059
#define OVERFLOW                      2060
#define N                             2061
#define NEGATIVE                      2062
#define FSR2L                         2063
#define PLUSW2                        2064
#define PREINC2                       2065
#define POSTDEC2                      2066
#define POSTINC2                      2067
#define INDF2                         2068
#define FSR1L                         2069
#define PLUSW1                        2070
#define PREINC1                       2071
#define POSTDEC1                      2072
#define POSTINC1                      2073
#define INDF1                         2074
#define WREG                          2075
#define FSR0L                         2076
#define PLUSW0                        2077
#define PREINC0                       2078
#define POSTDEC0                      2079
#define POSTINC0                      2080
#define INDF0                         2081
#define INTCON3                       2082
#define INT1IF                        2083
#define INT1F                         2084
#define INT2IF                        2085
#define INT2F                         2086
#define INT3F                         2087
#define INT3IF                        2088
#define INT1E                         2089
#define INT1IE                        2090
#define INT2IE                        2091
#define INT2E                         2092
#define INT3E                         2093
#define INT3IE                        2094
#define INT1P                         2095
#define INT1IP                        2096
#define INT2IP                        2097
#define INT2P                         2098
#define INTCON2                       2099
#define RBIP                          2100
#define INT3IP                        2101
#define INT3P                         2102
#define TMR0IP                        2103
#define T0IP                          2104
#define INTEDG3                       2105
#define INTEDG2                       2106
#define INTEDG1                       2107
#define INTEDG0                       2108
#define RBPU                          2109
#define NOT_RBPU                      2110
#define nRBPU                         2111
#define INTCON                        2112
#define RBIF                          2113
#define INT0F                         2114
#define INT0IF                        2115
#define T0IF                          2116
#define TMR0IF                        2117
#define RBIE                          2118
#define INT0E                         2119
#define INT0IE                        2120
#define T0IE                          2121
#define TMR0IE                        2122
#define PEIE                          2123
#define PEIE_GIEL                     2124
#define GIEL                          2125
#define GIE_GIEH                      2126
#define GIE                           2127
#define GIEH                          2128
#define PRODL                         2129
#define PRODH                         2130
#define TABLAT                        2131
#define TBLPTRL                       2132
#define TBLPTRH                       2133
#define PCL                           2134
#define PCLATH                        2135
#define PCH                           2136
#define SP0                           2137
#define STKPTR                        2138
#define SP1                           2139
#define SP2                           2140
#define SP3                           2141
#define SP4                           2142
#define STKUNF                        2143
#define STKOVF                        2144
#define STKFUL                        2145
#define TOSL                          2146
#define TOSH                          2147

#endif // _PIC18LF46J53_H_
